package tenco.com.test_01;

public class MainTest {

	public static void main(String[] args) {
	
		//무엇이든 담을 수 있는 제네릭(Generic)프로그래밍
		
        //제네릭 프로그래밍을 사용하는 이유는
	    //우리가 변수를 사용한다고 하면 항상 자료형을 먼저 선언해야 한다.
		//하지만 여러 자료형으로 사용될 수 있는 변수가 있을 때 사용할 수 있다.
		
		//int name duble name, String name //문법적으로 막아있어서 사용이 불가능
		
		//결론: 다양한 자료형이 적용될 수 있는 클래스를 만드는 것이 제네릭 프로그래밍 방식 입니다.
		
		//프로그래밍을 보다 안정적으로 설계할수가있다
		//컬렉션? 프레임워크에서 많이 사용된다
		
		//고민이!!!이 생길거다!!!??
		
		//컴파일러 기계언어로 바꿔주는 놈
		//제네릭으로 쓰면 사용하는 시점에 지정된 자료형으로 컴파일 됩니다.

	}

}
